In [1]:
import pandas as pd
import numpy as py

In [4]:
df = pd.read_csv("StudentsPerformance.csv")

In [6]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [10]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [16]:
df=df.drop(columns=['race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course'])

In [18]:
df.head()

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75

In [21]:
 pd.cut(df['math score'],bins = 4).value_counts()

(50.0, 75.0]     576
(75.0, 100.0]    274
(25.0, 50.0]     143
(-0.1, 25.0]       7
Name: math score, dtype: int64

In [23]:
grades = ['C','B','B+','A','A+']
cut_bins =[0,40,55,65,85,100]
df['grades'] = pd.cut(df['math score'],bins=cut_bins,labels=grades)

In [26]:
df.head()

   gender  math score  reading score  writing score grades
0  female          72             72             74      A
1  female          69             90             88      A
2  female          90             95             93     A+
3    male          47             57             44      B
4    male          76             78             75      A

In [31]:
#QCut():-Quantile-based discretization function.

pd.qcut(df['math score'],q=4).value_counts()

(-0.001, 57.0]    266
(66.0, 77.0]      264
(57.0, 66.0]      241
(77.0, 100.0]     229
Name: math score, dtype: int64

In [33]:
df['math score'].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

In [35]:
pd.qcut(df['math score'],q=6).value_counts()

(-0.001, 52.0]    179
(66.0, 73.0]      173
(60.0, 66.0]      168
(73.0, 81.0]      166
(52.0, 60.0]      160
(81.0, 100.0]     154
Name: math score, dtype: int64

In [37]:
grades = ['C','B','B+','A','A+']
df['math_labels'] = pd.qcut(df['math score'],q=[0,.40,.55, .65, .85, 1],labels=grades)

In [40]:
df.head()

   gender  math score  reading score  writing score grades math_labels
0  female          72             72             74      A          B+
1  female          69             90             88      A          B+
2  female          90             95             93     A+          A+
3    male          47             57             44      B           C
4    male          76             78             75      A           A

In [43]:
df['math_no_labels'] = pd.qcut(df['math score'],q=[0, .40, .55, .65, .85, 1],labels=False)

In [45]:
df.head()

,gender,math score,reading score,writing score,grades,math_labels,math_no_labels
0,female,72,72,74,A,B+,2
1,female,69,90,88,A,B+,2
2,female,90,95,93,A+,A+,4
3,male,47,57,44,B,C,0
4,male,76,78,75,A,A,3

In [46]:
grades = ['C','B','B+','A','A+']

In [49]:
results,bin_edges = pd.qcut(df['math score'],q=[0,.40,.55,.65,.85,1],labels=grades,retbins = True)

In [51]:
results

0      B+
1      B+
2      A+
3       C
4       A
       ..
995    A+
996     C
997     C
998     B
999     A
Name: math score, Length: 1000, dtype: category
Categories (5, object): ['C' < 'B' < 'B+' < 'A' < 'A+']

In [53]:
bin_edges

array([  0.,  62.,  68.,  72.,  82., 100.])

In [54]:
result_table = pd.DataFrame(zip('bin_edges','grades'),columns=['limits','grades'])

In [55]:
result_table

  limits grades
0      b      g
1      i      r
2      n      a
3      _      d
4      e      e
5      d      s